In [19]:
import pandas as pd

In [20]:
df = pd.read_csv("DSAssignment 1.csv")

In [21]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [22]:
df.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [23]:
df.notnull()

   Country    Age  Salary  Purchased
0     True   True    True       True
1     True   True    True       True
2     True   True    True       True
3     True   True    True       True
4     True   True   False       True
5     True   True    True       True
6     True  False    True       True
7     True   True    True       True
8     True   True    True       True
9     True   True    True       True

In [24]:
df.shape

(10, 4)

In [25]:
df.ndim

2

In [26]:
df.size

40

In [27]:
df.count()

Country      10
Age           9
Salary        9
Purchased    10
dtype: int64

In [28]:
df.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [30]:
df.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [35]:
df2=df['Purchased'].astype('string')

In [36]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [37]:
df2

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: string

In [38]:
df2.dtype

string[python]